data/raw_bench/1000_output.txt
Running 30s test @ http://10.99.59.146:8080/wrk2-api/home-timeline/read
  4 threads and 200 connections

  Thread calibration: mean lat.: 0.578ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.578ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.572ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.573ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://10.99.59.146:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   575.06us  171.00us   0.86ms   92.75%
    Req/Sec   264.17    165.51   700.00     75.17%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  562.00us
 75.000%  635.00us
 90.000%  705.00us
 99.000%    0.86ms
 99.900%    1.27ms
 99.990%    7.69ms
 99.999%   10.68ms
100.000%   10.68ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.281     0.000000            1         1.00
       0.451     0.100000         2040         1.11
       0.483     0.200000         4001         1.25
       0.510     0.300000         6006         1.43
       0.536     0.400000         8034         1.67
       0.562     0.500000        10043         2.00
       0.575     0.550000        11054         2.22
       0.589     0.600000        12067         2.50
       0.603     0.650000        13021         2.86
       0.618     0.700000        13998         3.33
       0.635     0.750000        15004         4.00
       0.644     0.775000        15509         4.44
       0.654     0.800000        16035         5.00
       0.664     0.825000        16503         5.71
       0.676     0.850000        17014         6.67
       0.689     0.875000        17506         8.00
       0.697     0.887500        17772         8.89
       0.705     0.900000        18006        10.00
       0.714     0.912500        18266        11.43
       0.724     0.925000        18516        13.33
       0.736     0.937500        18766        16.00
       0.742     0.943750        18877        17.78
       0.750     0.950000        19001        20.00
       0.759     0.956250        19131        22.86
       0.768     0.962500        19254        26.67
       0.779     0.968750        19379        32.00
       0.784     0.971875        19435        35.56
       0.793     0.975000        19498        40.00
       0.801     0.978125        19568        45.71
       0.810     0.981250        19624        53.33
       0.824     0.984375        19687        64.00
       0.829     0.985938        19716        71.11
       0.838     0.987500        19754        80.00
       0.847     0.989062        19780        91.43
       0.861     0.990625        19811       106.67
       0.880     0.992188        19841       128.00
       0.893     0.992969        19856       142.22
       0.914     0.993750        19873       160.00
       0.928     0.994531        19888       182.86
       0.978     0.995313        19903       213.33
       1.019     0.996094        19918       256.00
       1.041     0.996484        19926       284.44
       1.071     0.996875        19934       320.00
       1.099     0.997266        19942       365.71
       1.118     0.997656        19950       426.67
       1.158     0.998047        19957       512.00
       1.170     0.998242        19961       568.89
       1.205     0.998437        19965       640.00
       1.237     0.998633        19969       731.43
       1.250     0.998828        19973       853.33
       1.299     0.999023        19977      1024.00
       1.318     0.999121        19979      1137.78
       1.339     0.999219        19981      1280.00
       1.411     0.999316        19983      1462.86
       1.464     0.999414        19985      1706.67
       1.585     0.999512        19987      2048.00
       2.127     0.999561        19988      2275.56
       3.305     0.999609        19989      2560.00
       3.457     0.999658        19990      2925.71
       4.151     0.999707        19991      3413.33
       6.367     0.999756        19992      4096.00
       6.367     0.999780        19992      4551.11
       7.367     0.999805        19993      5120.00
       7.367     0.999829        19993      5851.43
       7.687     0.999854        19994      6826.67
       7.687     0.999878        19994      8192.00
       7.687     0.999890        19994      9102.22
      10.663     0.999902        19995     10240.00
      10.663     0.999915        19995     11702.86
      10.663     0.999927        19995     13653.33
      10.663     0.999939        19995     16384.00
      10.663     0.999945        19995     18204.44
      10.679     0.999951        19996     20480.00
      10.679     1.000000        19996          inf
#[Mean    =        0.575, StdDeviation   =        0.171]
#[Max     =       10.672, Total count    =        19996]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  29673 requests in 30.01s, 5.63MB read
  Socket errors: connect 0, read 0, write 0, timeout 25
Requests/sec:    988.90  
Transfer/sec:    192.18KB