data/raw_bench/100_output.txt
Running 30s test @ http://10.99.59.146:8080/wrk2-api/home-timeline/read
  4 threads and 200 connections

  Thread calibration: mean lat.: 0.903ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.825ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.862ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.866ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://10.99.59.146:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   800.14us  410.36us   1.13ms   99.24%
    Req/Sec    25.84     52.43   222.00     78.11%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  784.00us
 75.000%    0.87ms
 90.000%    0.95ms
 99.000%    1.13ms
 99.900%    1.84ms
 99.990%   17.95ms
 99.999%   17.95ms
100.000%   17.95ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.438     0.000000            1         1.00
       0.634     0.100000          200         1.11
       0.686     0.200000          398         1.25
       0.725     0.300000          593         1.43
       0.755     0.400000          790         1.67
       0.784     0.500000          997         2.00
       0.802     0.550000         1090         2.22
       0.815     0.600000         1184         2.50
       0.831     0.650000         1283         2.86
       0.847     0.700000         1383         3.33
       0.865     0.750000         1480         4.00
       0.874     0.775000         1529         4.44
       0.884     0.800000         1577         5.00
       0.896     0.825000         1634         5.71
       0.910     0.850000         1676         6.67
       0.929     0.875000         1727         8.00
       0.940     0.887500         1753         8.89
       0.946     0.900000         1774        10.00
       0.954     0.912500         1799        11.43
       0.967     0.925000         1824        13.33
       0.979     0.937500         1849        16.00
       0.986     0.943750         1861        17.78
       0.994     0.950000         1873        20.00
       1.008     0.956250         1886        22.86
       1.020     0.962500         1900        26.67
       1.038     0.968750         1910        32.00
       1.046     0.971875         1917        35.56
       1.054     0.975000         1922        40.00
       1.067     0.978125         1928        45.71
       1.080     0.981250         1936        53.33
       1.086     0.984375         1941        64.00
       1.094     0.985938         1944        71.11
       1.100     0.987500         1947        80.00
       1.126     0.989062         1950        91.43
       1.148     0.990625         1953       106.67
       1.190     0.992188         1956       128.00
       1.297     0.992969         1958       142.22
       1.434     0.993750         1959       160.00
       1.533     0.994531         1961       182.86
       1.552     0.995313         1962       213.33
       1.581     0.996094         1964       256.00
       1.612     0.996484         1965       284.44
       1.612     0.996875         1965       320.00
       1.616     0.997266         1966       365.71
       1.728     0.997656         1967       426.67
       1.771     0.998047         1968       512.00
       1.771     0.998242         1968       568.89
       1.771     0.998437         1968       640.00
       1.838     0.998633         1969       731.43
       1.838     0.998828         1969       853.33
       2.187     0.999023         1970      1024.00
       2.187     0.999121         1970      1137.78
       2.187     0.999219         1970      1280.00
       2.187     0.999316         1970      1462.86
       2.187     0.999414         1970      1706.67
      17.951     0.999512         1971      2048.00
      17.951     1.000000         1971          inf
#[Mean    =        0.800, StdDeviation   =        0.410]
#[Max     =       17.936, Total count    =         1971]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  2977 requests in 30.02s, 578.54KB read
  Socket errors: connect 0, read 0, write 0, timeout 1667
Requests/sec:     99.18  
Transfer/sec:     19.27KB