data/raw_bench/1100_output.txt
Running 30s test @ http://10.99.59.146:8080/wrk2-api/home-timeline/read
  4 threads and 200 connections

  Thread calibration: mean lat.: 0.575ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.569ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.573ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.573ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://10.99.59.146:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   568.96us  110.01us   0.85ms   74.85%
    Req/Sec   289.85    175.30   777.00     61.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  559.00us
 75.000%  630.00us
 90.000%  699.00us
 99.000%    0.85ms
 99.900%    1.17ms
 99.990%    2.14ms
 99.999%    4.78ms
100.000%    4.78ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.313     0.000000            1         1.00
       0.449     0.100000         2195         1.11
       0.482     0.200000         4468         1.25
       0.507     0.300000         6592         1.43
       0.532     0.400000         8811         1.67
       0.559     0.500000        11053         2.00
       0.571     0.550000        12078         2.22
       0.584     0.600000        13185         2.50
       0.599     0.650000        14329         2.86
       0.614     0.700000        15394         3.33
       0.630     0.750000        16491         4.00
       0.638     0.775000        17036         4.44
       0.647     0.800000        17591         5.00
       0.657     0.825000        18132         5.71
       0.668     0.850000        18652         6.67
       0.682     0.875000        19218         8.00
       0.690     0.887500        19484         8.89
       0.699     0.900000        19769        10.00
       0.708     0.912500        20034        11.43
       0.719     0.925000        20310        13.33
       0.731     0.937500        20584        16.00
       0.738     0.943750        20712        17.78
       0.747     0.950000        20852        20.00
       0.756     0.956250        20988        22.86
       0.766     0.962500        21137        26.67
       0.776     0.968750        21256        32.00
       0.783     0.971875        21327        35.56
       0.789     0.975000        21399        40.00
       0.799     0.978125        21465        45.71
       0.809     0.981250        21532        53.33
       0.822     0.984375        21601        64.00
       0.829     0.985938        21633        71.11
       0.839     0.987500        21669        80.00
       0.849     0.989062        21700        91.43
       0.860     0.990625        21736       106.67
       0.873     0.992188        21768       128.00
       0.885     0.992969        21788       142.22
       0.895     0.993750        21803       160.00
       0.921     0.994531        21820       182.86
       0.945     0.995313        21837       213.33
       0.971     0.996094        21854       256.00
       0.980     0.996484        21862       284.44
       0.993     0.996875        21871       320.00
       1.030     0.997266        21880       365.71
       1.051     0.997656        21888       426.67
       1.072     0.998047        21897       512.00
       1.092     0.998242        21902       568.89
       1.103     0.998437        21905       640.00
       1.135     0.998633        21910       731.43
       1.163     0.998828        21914       853.33
       1.175     0.999023        21918      1024.00
       1.205     0.999121        21920      1137.78
       1.221     0.999219        21922      1280.00
       1.244     0.999316        21925      1462.86
       1.260     0.999414        21927      1706.67
       1.295     0.999512        21929      2048.00
       1.297     0.999561        21930      2275.56
       1.320     0.999609        21931      2560.00
       1.392     0.999658        21932      2925.71
       1.455     0.999707        21933      3413.33
       1.573     0.999756        21934      4096.00
       1.616     0.999780        21935      4551.11
       1.616     0.999805        21935      5120.00
       1.682     0.999829        21936      5851.43
       1.682     0.999854        21936      6826.67
       2.143     0.999878        21937      8192.00
       2.143     0.999890        21937      9102.22
       2.143     0.999902        21937     10240.00
       3.929     0.999915        21938     11702.86
       3.929     0.999927        21938     13653.33
       3.929     0.999939        21938     16384.00
       3.929     0.999945        21938     18204.44
       3.929     0.999951        21938     20480.00
       4.779     0.999957        21939     23405.71
       4.779     1.000000        21939          inf
#[Mean    =        0.569, StdDeviation   =        0.110]
#[Max     =        4.776, Total count    =        21939]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  32606 requests in 30.00s, 6.19MB read
  Socket errors: connect 0, read 0, write 0, timeout 15
Requests/sec:   1086.77  
Transfer/sec:    211.20KB